In [8]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings("ignore")
np.__version__

'1.20.1'

In [7]:
pd.__version__

'1.2.4'

In [12]:
data=np.array(['a','b','c','d','e','f','g','h'])
s=pd.Series(data,index=[1,2,3,4,5,6,7,8])
s

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
dtype: object

In [14]:
age = {
    'A' : 34,
    'B' : 56,
    'B' : 78,
    'C' : 67,
    'D' : 45
}
age

f = pd.Series(age)
print(f)
print(type(s))
print(f.index) 
print(f.values)
print(f.shape)

A    34
B    78
C    67
D    45
dtype: int64
<class 'pandas.core.series.Series'>
Index(['A', 'B', 'C', 'D'], dtype='object')
[34 78 67 45]
(4,)

In [17]:
df = pd.DataFrame(f)
df

    0
A  34
B  78
C  67
D  45

In [18]:
df.shape

(4, 1)

In [19]:
df.values

array([[34],
       [78],
       [67],
       [45]], dtype=int64)

In [20]:
df.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df = pd.DataFrame(f, columns=['Age'])
df

   Age
A   34
B   78
C   67
D   45

In [23]:
df = df.reset_index()
df

  index  Age
0     A   34
1     B   78
2     C   67
3     D   45

In [24]:
df.columns = ['Age', 'Population']
df

  Age  Population
0   A          34
1   B          78
2   C          67
3   D          45

In [26]:
import seaborn as sns

Matplotlib is building the font cache; this may take a moment.

In [27]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [29]:
dfmpg=sns.load_dataset("mpg")
dfmpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [31]:
dfmpg.origin.unique()

array(['usa', 'japan', 'europe'], dtype=object)

In [32]:
dfmpg[(dfmpg['origin']=='usa')]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
392,27.0,4,151.0,90.0,2950,17.3,82,usa,chevrolet camaro
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10